Repository: shceo/MirTaxi-user
Catalog: flutter-user-master/lib/l10n/app_*.arb
Languages: ru, uz

# text_enter_social
source: or Enter Social Media
ru: или Войти через социальные сети
uz: Yoki ijtimoiy tarmoqlarga kiring

# text_sign_up
source: Sign Up
ru: Регистрация
uz: Ro'yxatdan o'tish

# text_track_location
source: Tracking Taxi Location
ru: Отслеживание местоположения такси
uz: Taksi joylashuvini kuzatish

# text_keep_track
source: Remember to keep track of Ride professional accomplishments
ru: Не забывайте следить за своими профессиональными достижениями
uz: Proffesional yutuqlarni kuzatib borishni unutmang

# text_skip
source: skip
ru: Пропустить
uz: O'tkazib yuborish

# text_next
source: next
ru: Следующий
uz: keyingisi

# text_your_ride
source: Your ride, on demand
ru: Ваша поездка
uz: Sizning yurishingiz, so'rovingiz bo'yicha

# text_login
source: Login
ru: Вход
uz: Kirish

# text_phone_number
source: phone number
ru: номер телефона
uz: Telefon raqam

# text_get_started
source: Let's Get Started!
ru: Начнем!
uz: Boshlaymiz!

# text_fill_form
source: Fill the form to continue.
ru: Заполните данную форму, для продолжения.
uz: Davom etish uchun formani to'ldiring.

# text_signup_social
source: Sign up with Social of fill the form to continue.
ru: Для продолжения, можете использовать соц. сети
uz: Davom etish uchun formani to'ldirib, ijtimoiy tarmoqlarda ro'yxatdan o'ting.

# text_email
source: Email
uz: Elektron pochta

# text_name
source: Name
ru: Имя
uz: Ism

# text_agree
source: By Signing up, you agree to the
ru: Подписавшись, Вы соглашаетесь с
uz: Ro'yhatdan o'tish orqali , siz quyidagilarga rozi bo'lasiz

# text_terms
source: Terms of Service
ru: условиями обслуживания
uz: Xizmat ko'rsatish shartlari

# text_and
source: and
ru: а также
uz: va

# text_privacy
source: Privacy Policy
ru: Политикой конфиденциальности
uz: Maxfiylik siyosati

# text_fastest_way
source: Fastest way to book Taxi without the hassle of waiting & haggling of price
ru: Быстрый способ вызвать такси
uz: Kutish va narx-navo savdolarisiz taksi bron qilishning eng tezkor usuli

# text_phone_verify
source: Phone Verification
ru: Верификация номера телефона
uz: Telefon raqamni tekshirish

# text_enter_otp
source: Please enter the 6-digit code send to you at
ru: Пожалуйста, введите 6-значный код
uz: Iltimos, sizga yuborilgan 6 xonali kodni kiriting

# text_resend_code
source: Resend Code
ru: Отправить код еще раз
uz: Kodni qayta yuborish

# text_verify
source: Verify Now
ru: Проверить сейчас
uz: Hozir tasdiqlang

# text_pick_up_location
source: Pick up Location
ru: Выбрать место
uz: Joylashuvni olish

# text_drop
source: Drop
ru: Отменить
uz: Tushirish

# text_daily
source: Daily
ru: Ежедневно
uz: Kundalik

# text_rental
source: Rental
ru: Аренда
uz: Ijara

# text_search
source: Search
ru: Поиск
uz: Qidirish

# text_pick_up
source: Pick-up
ru: Подобрать
uz: Olib ketish

# text_confirm
source: Confirm
ru: Подтвердить
uz: Tasdiqlash

# text_favourites
source: Favourites
ru: Избранное
uz: Saqlanganlar

# text_clear
source: Clear
ru: Очистить
uz: Tozalash

# text_vehicle_make
source: What make of vehicle is it?
ru: Какой марки это транспортное средство?
uz: U qanday avtomobil markasi?

# text_continue
source: Continue
ru: Продолжить
uz: Davom etish

# text_vehicle_model
source: What model of vehicle is it?
ru: Какая модель автомобиля?
uz: Bu avtomobilning qaysi modeli?

# text_service_location
source: What service location you want to register?
ru: Какое место обслуживания вы хотите зарегистрировать?
uz: Siz qaysi xizmat joyini ro'yxatdan o'tkazmoqchisiz?

# text_vehicle_type
source: What type of vehicle is it?
ru: Марка транспортного средства?
uz: Bu qanday turdagi avtomobil?

# text_vehicle_color
source: What color of vehicle is it?
ru: Какой цвет автомобиля?
uz: Bu avtomobilning rangi qanday?

# text_license
source: Vehicle Number
ru: Гос. номер автомобиля
uz: Avtomobil raqami

# text_enter_vehicle
source: Enter Your Vehicle Number
ru: Введите гос. номер вашего автомобиля
uz: Avtomobil raqamingizni kiriting

# text_vehicle_model_year
source: What is the Vehicle's model year
ru: Какого года транспортное средство
uz: Avtomobilning yili

# text_apply_referral
source: Apply Referral
ru: использовать реферальный код
uz: Murojaatni qo'llash

# text_enter_referral
source: Enter Referral Code
ru: Введите реферальный код
uz: Kodni kiriting

# text_apply
source: Apply
ru: Подать заявление
uz: Qo'llash

# text_manage_docs
source: Manage Documents
ru: Управление документами
uz: Hujjatlarni boshqarish

# text_passport
source: Passport
ru: Пасспорт или ID карта
uz: Pasport

# text_not_uploaded
source: Not Uploaded
ru: Не загружено
uz: Yuklanmagan

# text_uploaded
source: Uploaded
ru: Загружен
uz: Yuklandi

# text_upload
source: Upload
ru: Загрузить
uz: Yuklash

# text_send_approval
source: Your document is still pending for verification. Once it's all verified you start getting rides. Please sit tight
ru: Ваши документ находяться ожидании проверки. Пожалуйста, подождите.
uz: Sizning hujjatingiz hali ham tekshirish uchun kutilmoqda. Hammasi tasdiqlangandan so'ng siz sayr qilishni boshlaysiz. Iltimos, qattiq o'tiring

# text_upload_docs
source: Upload Documents
ru: Загрузите документы
uz: Hujjatlarni yuklash

# text_choose_language
source: Choose Language
ru: Выберите язык
uz: Tilni tanlang

# text_enter_vehicle_model_year
source: Enter your Vehicle Model Year
ru: Введите год выпуска вашего автомобиля
uz: Avtomobilingiz model yilini kiriting

# text_edit_docs
source: Update Documents
ru: Редактировать документы
uz: Hujjatlarni yangilash

# text_account_blocked
source: Account Blocked
ru: Счет заблокирован
uz: Hisob bloklangan

# text_document_rejected
source: Your Account is blocked for the following reasons
ru: Ваша учетная запись заблокирована по следующим причинам
uz: Sizning hisobingiz quyidagi sabablarga ko'ra bloklangan

# text_contact_admin
source: Contact your Admin
ru: Свяжитесь с вашим администратором
uz: Admin bilan bog'laning

# text_enable_location
source: Please Enable Your Location
ru: Пожалуйста, включите Ваше местоположение
uz: Iltimos, joylashuvingizni yoqing

# text_loc_permission
source: Allow Location all the time - To book a taxi
ru: Включить Ваше местоположение для бронирования такси
uz: Har doim joylashuvga ruxsat berish-taksini bron qilish

# text_off_duty
source: On Duty
ru: На работе
uz: Xizmatda

# text_on_duty
source: Off Duty
ru: Не на работе
uz: Xizmatdan tashqari

# text_pickpoint
source: Pickup point
ru: Точка сбора
uz: Qabul qilish nuqtasi

# text_droppoint
source: Dropout point
ru: Конечная точка
uz: Chiqish nuqtasi

# text_decline
source: Decline
ru: Отклонить
uz: Rad etish

# text_accept
source: Accept
ru: Принять
uz: Qabul qiling

# text_call
source: Call
ru: Вызов
uz: Qo'ng'iroq qilish

# text_chat
source: Chat
ru: Чат
uz: Suhbat

# text_cancel
source: Cancel
ru: Отмена
uz: Bekor qilish

# text_arrived
source: Arrived
ru: Прибыли
uz: Keldi

# text_youareonline
source: You are Online now
ru: Вы сейчас в сети
uz: Siz hozir onlaynsiz

# text_youareoffline
source: You are Offline now
ru: Вы сейчас оффлайн
uz: Siz hozir Oflaynsiz

# text_arriving
source: Arriving
ru: Прибытие
uz: Kelyapti

# text_onride
source: Way to Drop
ru: Возможность высадить
uz: Tushish yo'li

# text_startride
source: Start Ride
ru: Начать поездку
uz: Yurishni boshlash

# text_endtrip
source: End Trip
ru: Окончить поездку
uz: Yurishni tugatish

# text_driver_otp
source: Enter OTP
ru: Введите код
uz: OTP ni kiriting

# text_enterdriverotp
source: Enter the OTP displayed in Customer's mobile to start the ride
ru: Введите код, для начала поезки
uz: Safarni boshlash uchun mijozning mobil telefonida ko'rsatilgan OTP-ni kiriting

# text_enable_history
source: History
ru: История
uz: Tarix

# text_enable_wallet
source: Wallet
ru: Кошелек
uz: Hamyon

# text_change_language
source: Change Language
ru: Изменить язык
uz: Tilni o'zgartirish

# text_about
source: About
ru: О нас
uz: Haqida

# text_logout
source: Logout
ru: Выйти
uz: Chiqish

# text_tripsummary
source: Trip Summary
ru: Отзыв о поездке
uz: Sayohat xulosasi

# text_reference
source: Reference Number
ru: Реферальный код
uz: Ma'lumot raqami

# text_rideType
source: Type of Ride
ru: Тип поездки
uz: Safar turi

# text_distance
source: Distance
ru: Расстояние
uz: Masofa

# text_duration
source: Duration
ru: Продолжительность
uz: Davomiyligi

# text_tripfare
source: Fare Breakup
ru: Разбивка тарифа
uz: Tarifni buzish

# text_baseprice
source: Base Price
ru: Базовая цена
uz: Asosiy narx

# text_taxes
source: Taxes
ru: Налоги
uz: Soliqlar

# text_distprice
source: Distance Price
ru: Цена расстояния
uz: Masofa narxi

# text_timeprice
source: Time Price
ru: Цена времени
uz: Vaqt narxi

# text_cancelfee
source: Cancellation Fee
ru: Плата за отмену бронирования
uz: Bekor qilish to'lovi

# text_convfee
source: Convenience Fee
ru: Плата за удобство
uz: Qulaylik to'lovi

# text_totalfare
source: Total Fare
ru: Общая стоимость проезда
uz: Umumiy tarif

# text_cash
source: Cash
ru: Наличные
uz: Naqd pul

# text_trust_contact
source: Trusted Contact
ru: Доверенный контакт
uz: Ishonchli kontakt

# text_trust_contact_1
source: Share your trip status
ru: Поделитесь статусом своей поездки
uz: Safaringiz holatini baham ko'ring

# text_trust_contact_2
source: Youâ€™ll be able to share your live location with one or more contacts during any trip
ru: Вы сможете поделиться своим текущим местоположением с одним или несколькими контактами во время любой поездки
uz: Siz har qanday sayohat paytida jonli manzilingizni bir yoki bir nechta kontaktlar bilan baham ko'rishingiz mumkin

# text_trust_contact_3
source: Set your emergency contacts
ru: Установите свои контакты для экстренной помощи
uz: Favqulotli holatlar uchun kontaktlaringizni kiriting

# text_trust_contact_4
source: You can make a trusted contact an emergency contact. You can call them in case of emergency.
ru: Вы можете сделать доверенный контакт экстренным контактом. Вы можете позвонить им в случае крайней необходимости.
uz: Siz ishonchli kontaktni Favqulotli holatlar uchun kontaktlarga aylantirishingiz mumkin. Favqulodda holatlarda siz ularga qo'ng'iroq qilishingiz mumkin.

# text_add_trust_contact
source: Add trusted contact
ru: Добавить доверенный контакт
uz: ishonchli kontakt qo'shish

# text_submit
source: Submit
ru: Отправить
uz: Yuborish

# text_feedback
source: Give your Feedback
ru: Оставить свой отзыв
uz: Fikringizni bering

# text_cancel_reason
source: Cancel Reason
ru: Причина отмены
uz: Bekor qilish sababi

# text_cancelrequest
source: Cancel Request
ru: Отменить запрос
uz: So'rovni bekor qilish

# text_entercancelreason
source: Enter Cancel Reason
ru: Введите причину отмены
uz: Bekor qilish sababini kiriting

# text_pickdroplocation
source: Choose Drop Location
ru: Выберите местоположение для высадки
uz: Tushish joyini tanlang

# text_choosepicklocation
source: Choose Pick Location
ru: Выберите местоположение для того, чтобы Вас забрать
uz: Boshlash joyini tanlang

# text_fav_address
source: Favourite Address
ru: Избранный адрес
uz: Sevimli manzil

# text_pick_suggestion
source: Pickup Suggestion
ru: Предложение по доставке
uz: Boshlash taklifi

# text_drop_suggestion
source: Drop Suggestion
ru: Предложение по отправке
uz: Taklif qoldirish

# text_chooseonmap
source: Locate on Map
ru: Найти на карте
uz: Xaritada toping

# text_4lettersforautofill
source: Enter 4 letters to search
ru: Введите 4 буквы для поиска
uz: Qidirish uchun 4 ta harf kiriting

# text_availablerides
source: Available Rides
ru: Доступные поездки
uz: Mavjud sayohatlar

# text_paymentmethod
source: Payment Method
ru: Способ оплаты
uz: To'lov usuli

# text_choose_paynoworlater
source: Choose your payment now or later
ru: Выберите свой платеж сейчас или позже
uz: To'lovingizni hozir yoki keyinroq tanlang

# text_paycash
source: Pay when trip ends
ru: Оплатите, когда поездка закончится
uz: Yurish tugaganda to'lash

# text_paycard
source: For seamless and contact less payment
ru: Для бесперебойной и бесконтактной оплаты
uz: Uzluksiz va aloqa kam to'lov uchun

# text_payupi
source: For faster payment
ru: Для более быстрой оплаты
uz: Tezroq to'lov uchun

# text_paywallet
source: For Instant payment
ru: Для мгновенной оплаты
uz: Tezkor to'lov uchun

# text_payingvia
source: Paying via
ru: Оплата через
uz: Orqali to'lash

# text_enterpromo
source: Enter Promo Code
ru: Введите промо-код
uz: Promo-kodni kiriting

# text_remove
source: Remove
ru: Удалить
uz: olib tashlash

# text_edit
source: Edit
ru: Редактировать
uz: Tahrirlash

# text_promoaccepted
source: Coupon Applied
uz: Kupon qo'llanildi

# text_promorejected
source: Invalid Coupon Code
ru: Неверный код купона
uz: Noto'g'ri Kupon kodi

# text_findingdriver
source: Looking for nearby drivers
ru: Ищем водителей поблизости
uz: Yaqin atrofdagi haydovchilarni qidirish

# text_finddriverdesc
source: We are looking for nearby drivers to accept your ride. Once accepted you can ride with us! We appreciate your patience!
ru: Мы ищем водителей поблизости, которые согласятся на вашу поездку. После получения согласия вы можете ехать с нами! Мы ценим ваше терпение!
uz: Biz sizning sayohatingizni qabul qilish uchun yaqin atrofdagi haydovchilarni qidirmoqdamiz. Qabul qilingandan so'ng siz minishingiz mumkin! Biz sizning sabr-toqatingizni qadrlaymiz!

# text_pickup_instruction
source: Any Instructions for pick up
ru: Какие-либо инструкции по доставке
uz: Moshinaga chiqish uchun har qanday ko'rsatmalar

# text_shareride
source: Share Ride
ru: Поделитесь поездкой
uz: Safarni baham ko'rish

# text_ridecancel
source: Are you sure to cancel ride
ru: Вы уверены, что отмените поездку
uz: Safarni bekor qilishingizga ishonchingiz komilmi

# text_ridecancel_desc
source: Your ride will be cancelled and returned to main menu. This will lead to cancellation fee
ru: Ваша поездка будет отменена и возвращена в главное меню. Это приведет к взиманию платы за отмену
uz: Safaringiz bekor qilinadi va asosiy menyuga qaytariladi. Bu amal uchun to'lov olinadi

# tex_dontcancel
source: Don't Cancel
ru: Не отменять
uz: Bekor qilmang

# text_cancelRideReason
source: Reason for cancelling ride
ru: Причина отмены поездки
uz: Safarni bekor qilish sababi

# text_nodriver
source: No Driver Found
ru: Водитель не найден
uz: Haydovchi topilmadi

# text_tryagain
source: Try Again
ru: Повторите попытку
uz: Qayta urinib ko'ring

# text_ridelater
source: Ride Later
ru: Поездка позже
uz: Keyinroq safar qiling

# text_ridenow
source: Ride Now
ru: Поездка сейчас
uz: Hozir Mining

# text_home
source: Home
ru: Главная
uz: Uy

# text_work
source: Work
ru: Работа
uz: Ish

# text_others
source: Others
ru: Другие
uz: Boshqalar

# text_enterfavname
source: Enter Favourites Name
ru: Введите имя избранного
uz: Sevimlilar nomini kiriting

# text_confirmridelater
source: Are you sure to choose ride in this time
ru: Вы уверены, что выбрали поездку в этот раз
uz: Siz tanlaganingizga ishonchingiz komilmi?

# text_rideLaterSuccess
source: Ride is confirmed successfully
ru: Поездка успешно подтверждена
uz: Sayohat muvaffaqiyatli tasdiqlandi

# text_saveaddressas
source: Save as Favourite
ru: Сохранить как избранное
uz: Sevimli sifatida saqlash

# text_trustedtaxi
source: Most Trusted Taxi Booking App
ru: Самое надежное приложение для бронирования такси
uz: Eng ishonchli taksilarni bron qilish ilovasi

# text_allowpermission1
source: To enjoy your ride experience
ru: Чтобы насладиться поездкой
uz: Safar tajribangizdan zavqlanish uchun

# text_allowpermission2
source: Please allow us the following permissions
ru: Пожалуйста, предоставьте нам следующие разрешения
uz: iltimos, bizga quyidagilarga ruxsat bering

# text_allow
source: Allow
ru: Разрешить
uz: Ruxsat berish

# text_drivercancelled
source: Ride Cancelled by Driver
ru: Поездка отменена водителем
uz: haydovchi tomonidan sayohat bekor qilindi

# text_cancelsuccess
source: Ride Cancelled Successfully
ru: Поездка успешно отменена
uz: Safar muvaffaqiyatli bekor qilindi

# text_notifyadmin
source: Notify Admin
ru: Уведомить Администратор
uz: Admin xabardor

# text_notifysuccess
source: Notified Successfully
ru: Уведомление получено успешно
uz: Muvaffaqiyatli xabardor

# text_chatwithdriver
source: Chat With Driver
ru: Чат с водителем
uz: Haydovchi bilan suhbat

# text_entermessage
source: Enter Message
ru: Введите сообщение
uz: Xabarni kiriting

# text_newmessagereceived
source: New Message Received
ru: Получено новое сообщение
uz: Yangi xabar qabul qilindi

# text_nointernet
source: No Internet Connection
ru: Нет подключения к Интернету
uz: Internetga ulanish yo'q

# text_nointernetdesc
source: Please check your internet connection, try enabling wifi or try again later
ru: Пожалуйста, проверьте ваше подключение к Интернету, попробуйте включить Wi-Fi или повторите попытку позже
uz: Iltimos, internetga ulanishni tekshiring, keyinroq qayta urinib ko'ring

# text_copyrights
source: Copyrights
ru: Авторские права
uz: Mualliflik huquqlari

# text_termsandconditions
source: Terms and Conditions
ru: Правила и условия
uz: Sharhlar va shartlar

# text_yourTrustedContacts
source: Your Trusted Contacts
ru: Ваши доверенные контакты
uz: Sizning ishonchli kontaktlaringiz

# text_removeSos
source: Are you sure to remove this contact from your trusted Contact
ru: Вы уверены, что удалили этот контакт из списка доверенных контактов
uz: Ushbu kontaktni ishonchli kontaktingizdan olib tashlashga ishonchingiz komilmi?

# text_noDataFound
source: No Data Found
ru: Данные не найдены
uz: Ma'lumot topilmadi

# text_removeFav
source: Are you sure to remove this address from your favorites
ru: Вы уверены, что удалили этот адрес из избранного
uz: Ushbu manzilni sevimlilaringizdan olib tashlashga ishonchingiz komilmi

# text_invite
source: Invite
ru: Пригласить
uz: Taklif qilish

# text_invitation_1
source: Join me on Tagxi! using my invite code
ru: Присоединяйтесь ко мне на Tagxi! используя мой пригласительный код
uz: Md taxi ga qo'shiling! mening taklif kodimdan foydalanish

# text_invitation_2
source: To make easy your ride
ru: Чтобы облегчить вашу поездку
uz: Oson safar qilish uchun

# text_upcoming
source: Upcoming
ru: Предстоящий
uz: Kutilayapti

# text_completed
source: Completed
ru: Завершено
uz: Tugadi

# text_cancelled
source: Cancelled
ru: Отменено
uz: Bekor qilindi

# text_card
source: Card
ru: Карточка
uz: Karta

# text_loadmore
source: Load More
ru: Загрузить больше
uz: Ko'proq yuklash

# text_location
source: Location details
ru: Сведения о местоположении
uz: Joylashuv tafsilotlari

# text_assigned
source: Assigned
ru: Назначен
uz: Tayinlangan

# text_started
source: Started
ru: Запущен
uz: Boshlandi

# text_availablebalance
source: Available Balance
ru: Доступный баланс
uz: Mavjud balans

# text_addmoney
source: Add Money
ru: Добавить деньги
uz: Pul qo'shish

# text_recenttransactions
source: Recent Transactions
ru: Последние транзакции
uz: oxirgi operatsiyalar

# text_deposit
source: Deposit
ru: Депозит
uz: Depozit

# text_ridepayment
source: Ride Payment
ru: Оплата поездки
uz: Safar to'lovi

# text_enteramount
source: Enter Amount Here
ru: Введите сумму здесь
uz: Miqdorni bu erga kiriting

# text_editprofile
source: Edit Profile
ru: Редактировать профиль
uz: Profilni tahrirlash

# text_editimage
source: Edit Image
ru: Редактировать изображение
uz: Rasmni tahrirlash

# text_pay
source: Pay
ru: Оплатить
uz: To'lash

# text_somethingwentwrong
source: Something Went Wrong, Try again
ru: Что-то пошло не так, попробуйте еще раз
uz: Biror narsa noto'g'ri ketdi, qayta urinib ko'ring

# text_paymentsuccess
source: Payment successful
ru: Платеж успешен
uz: To'lov muvaffaqiyatli

# text_camera
source: Camera
ru: Камера
uz: Kamera

# text_gallery
source: Gallery
ru: Галерея
uz: Galereya

# text_updateVehicle
source: Update Vehicle Info
ru: Обновить информацию о транспортном средстве
uz: Avtomobil ma'lumotlarini yangilash

# text_make
source: Vehicle Make
ru: Марка транспортного средства
uz: Avtomobil tanlash

# text_model
source: Vehicle Model
ru: Модель транспортного средства
uz: Avtomobil modeli

# text_year
source: Vehicle Year
ru: Год выпуска транспортного средства
uz: Avtomobil yili

# text_type
source: Vehicle Type
ru: Тип транспортного средства
uz: Avtomobil turi

# text_number
source: Vehicle Number
ru: Номер транспортного средства
uz: Avtomobil raqami

# text_color
source: Vehicle Color
ru: Цвет транспортного средства
uz: Avtomobil rangi

# text_tapfordocs
source: Tap here to upload
ru: Нажмите здесь, чтобы загрузить
uz: Yuklash uchun shu yerni bosing

# text_earnings
source: Earnings
ru: Заработок
uz: Daromad

# text_today
source: Today
ru: Сегодня
uz: Bugun

# text_weekly
source: Weekly
ru: Еженедельно
uz: Haftalik

# text_monthly
source: Monthly
ru: Ежемесячно
uz: Oylik

# text_trips
source: Trips
ru: Поездки
uz: Sayohatlar

# text_hours
source: Hours
ru: Часы
uz: Soat

# text_tripkm
source: Trip Kms
ru: Километры поездки
uz: Sayohat masofasi

# text_walletpayment
source: Wallet Payment
ru: Оплата кошельком
uz: Hamyondan to'lov

# text_cashpayment
source: Cash Payment
ru: Оплата наличными
uz: Naqd pulda to'lov

# text_totalearnings
source: Total Earnings
ru: Общий заработок
uz: Jami daromad

# text_report
source: Report
ru: Отчет
uz: Hisobot

# text_fromDate
source: From Date
ru: С даты
uz: Kundan boshlab

# text_toDate
source: To Date
ru: На сегодняшний день
uz: Kungacha

# text_withdraw
source: Withdraw
ru: Вывести
uz: Yechib olish

# text_withdrawHistory
source: Withdraw History
ru: История вывода
uz: Yechib olishlar tarixi

# text_withdrawReqAt
source: Withdraw Request At
ru: Запрос на вывод средств по адресу
uz: Yechib olish surovi

# text_bankDetails
source: Bank Details
ru: Банковские реквизиты
uz: Bank rekvizitlari

# text_accoutHolderName
source: Account Holder Name
ru: Имя владельца счета
uz: Hisob egasining ismi

# text_accountNumber
source: Account Number
ru: Номер счета
uz: Hisob raqami

# text_bankCode
source: Bank Code
ru: Код банка
uz: Bank kodi

# text_bankName
source: Bank Name
ru: Название банка
uz: Bank nomi

# text_updateBank
source: Update Bank Info
ru: Обновить банковскую информацию
uz: Bank ma'lumotlarini yangilash

# text_confirmlogout
source: Are you sure want to logout
ru: Вы уверены, что хотите выйти из системы
uz: Siz tizimdan chiqishni xohlaysizmi

# text_wallet
source: Wallet
ru: Кошелек
uz: hamyon

# text_startridewithotp
source: Start Ride with OTP
ru: Начать поездку с OTP
uz: OTP bilan minishni boshlang

# text_loadingLocalization
source: Loading Localization
ru: Локализация загрузки
uz: Lokatsiya yuklanyapti

# text_background_permission
source: Enable Background Location - to give you ride request even if your app is in background
ru: Включить фоновое местоположение - чтобы отправить вам запрос на поездку, даже если ваше приложение работает в фоновом режиме
uz: Fonda ishlashni yoqish-ilovangiz fonda bo'lsa ham sizga joylashuvni bildirib turadi

# text_user_cancelled_request
source: User Cancelled the Request
ru: Пользователь отменил запрос
uz: Foydalanuvchi so'rovni bekor qildi

# text_low_balance
source: Your wallet balance is low, please add some money to continue service
ru: Баланс вашего кошелька низкий, пожалуйста, добавьте немного денег, чтобы продолжить обслуживание
uz: Sizning hamyoningiz balansi past, iltimos, xizmatni davom ettirish uchun pul qo'shing

# text_otp_error
source: Please enter correct Otp or resend
ru: Пожалуйста, введите правильный Otp или отправьте повторно
uz: Iltimos, to'g'ri OTP kiriting yoki qayta yuboring

# text_code_copied
source: Referral Code Copied
ru: Скопирован реферальный код
uz: Yo'naltiruvchi kod nusxalandi

# text_loc_permission_user
source: Allow Location - To book a taxi
ru: Разрешить местоположение - заказать такси
uz: joylashuvga ruxsat berish-moshinani bron qilish uchun
