Repository: shceo/MirTaxi-user
Catalog: flutter-user-master/lib/l10n/app_*.arb
Languages: ru, uz

# text_low_wallet_for_ride
source: Your Wallet Balance is too low to make this race
ru: Баланс вашего кошелька слишком мал для участия в этой гонке
uz: Sizning hamyon balansingiz bu buyurtmani olish uchun juda past

# text_internal_server_error
source: Internal Server Error
ru: Внутренняя ошибка сервера
uz: Ichki Server xatosi

# text_supported_vehicles
source: Supported Vehicles
ru: Поддерживаемые транспортные средства
uz: Qo'llab-quvvatlanadigan transport vositalari

# text_description
source: Description
ru: Описание
uz: Tavsif

# text_estimated_amount
source: Estimated Amount
ru: Предполагаемая сумма
uz: Taxminiy miqdor

# text_open_loc_settings
source: Location access is needed for running the app, please enable it in settings and tap done
ru: Для запуска приложения необходим доступ к местоположению, пожалуйста, включите его в настройках и нажмите готово
uz: Ilovani ishga tushirish uchun joylashuvga kirish kerak, iltimos, uni sozlamalarda yoqing va bajarildi ga bosing

# text_open_settings
source: Open Settings
ru: Открыть настройки
uz: Sozlamalarni ochish

# text_done
source: Done
ru: Готово
uz: Bajarildi

# text_open_contact_setting
source: Contact access is needed to pick contact for SOS, pleable enable it in settings and tap done
ru: Для выбора контакта для SOS необходим доступ к контакту, пожалуйста, включите его в настройках и нажмите готово
uz: SOS uchun kontaktni tanlash uchun kontaktga kirish kerak,uni sozlamalarda yoqing va bajarildi ga bosing

# text_open_camera_setting
source: Camera access is needed to capture image, please enable it in settings and tap done
ru: Для захвата изображения необходим доступ к камере, пожалуйста, включите его в настройках и нажмите готово
uz: Rasmga olish uchun kameraga kirish kerak, iltimos, uni sozlamalarda yoqing va bajarildi ga bosing

# text_open_photos_setting
source: Photos access is needed to pick image, please enable it in settings and tap done
ru: Для выбора изображения необходим доступ к фотографиям, пожалуйста, включите его в настройках и нажмите готово
uz: Rasmni tanlash uchun fotosuratlarga kirish kerak, iltimos uni sozlamalarda yoqing va bajarildi-ga bosing

# text_enter_otp_login
source: Enter Otp
ru: Введите Otp
uz: OTP ni kiriting

# text_add_by_card
source: Add by Card
ru: Добавить картой
uz: Karta orqali qo'shish

# text_add_by_kiosk
source: Add by Kiosk
ru: Добавить с помощью киоска
uz: Kiosk orqali Qo'shish

# text_pay_by_card
source: Pay by Card
ru: Оплатить картой
uz: Karta orqali to'lash

# text_pay_by_kiosk
source: Pay by Kiosk
ru: Оплатить с помощью киоска
uz: Kiosk orqali to'lash

# text_error_trip_otp
source: Please enter valid OTP
ru: Пожалуйста, введите действительный OTP
uz: OTP ni to'g'ri kiriting

# text_bill_reference
source: Bill Reference
ru: Ссылка на счет
uz: Ma'lumotlar

# text_subscriptions
source: Subscriptions
ru: Подписки
uz: Obunalar

# text_select_sub_plan
source: Select a plan to continue
ru: Выберите план для продолжения
uz: Davom etish uchun tarifni tanlang

# text_sub_text1
source: Spot payment to your wallet
ru: Мгновенный платеж на ваш кошелек
uz: Hamyoningizga Spot to'lov

# text_sub_text2
source: Benefits of getting whole amount
ru: Преимущества получения всей суммы
uz: Butun miqdorni olishning afzalliklari

# text_sub_text3
source: Get priority customer support
ru: Получите приоритет служба поддержки клиентов
uz: Mijozlarni qo'llab-quvvatlashni oling

# text_sub_text4
source: 0% commission
ru: комиссия 0%
uz: 0% komissiya

# text_sub_ended
source: Your Subscription is ended
ru: Ваша подписка завершена
uz: Sizning obunangiz tugadi

# text_sub_ended_1
source: Your Subscription has ended on
ru: Ваша подписка закончилась
uz: Sizning obunangiz tugadi

# text_purchase_now
source: Purchase now
ru: Покупка сейчас
uz: Hozir sotib oling

# text_browse_plans
source: Browse Plans
ru: Просмотр планов
uz: Tariflarni ko'rib chiqish

# text_monthly_plan
source: Monthly Plan
ru: Ежемесячный план
uz: Oylik tarif

# text_yearly_plan
source: Yearly Plan
ru: Годовой план
uz: Yillik tarif

# text_rideLaterTime
source: Ride Scheduled at
ru: Поездка запланирована на
uz: Safar rejalashtirilgan

# text_cancel_ride
source: Cancel Ride
ru: Отменить поездку
uz: Safarni bekor qilish

# text_sub_ended_2
source: Subscribe a plan to continue getting rides
ru: Подписаться на план, чтобы продолжать получать поездки
uz: Safarni davom ettirish uchun tarifga obuna bo'ling

# text_make_complaints
source: Make Complaints
ru: Подавать жалобы
uz: Shikoyat qiling

# text_complaint_1
source: Click Below to Choose Type
ru: Нажмите ниже, чтобы выбрать Тип
uz: Turini tanlash uchun pastga bosing

# text_complaint_2
source: Write your complaint here
ru: Напишите свою жалобу здесь
uz: Shikoyatingizni shu yerga yozing

# text_complaint_success
source: We Successfully Got Your Concern...
ru: Мы успешно ответили на Ваше беспокойство...
uz: Biz Sizning murojaatingizni muvaffaqiyatli oldik.

# text_complaint_success_2
source: We Will Get You Sooner
ru: Мы свяжемся с Вами раньше
uz: Biz tez orada qabul qilamiz

# text_thankyou
source: Thank You
ru: Спасибо
uz: Rahmat

# text_complaint_3
source: minimum 10 characters
ru: минимум 10 символов
uz: Minimal 10 belgi

# text_free_trail_1
source: Try Free Trial for 1 Month
ru: Попробуйте бесплатную пробную версию на 1 месяц
uz: 1 oy davomida bepul sinovni sinab ko'ring

# text_free_trail_2
source: Are you sure to get Free Trial for 1 month
ru: Вы уверены, что получите бесплатную пробную версию на 1 месяц
uz: 1 oy davomida bepul sinov muddatini olishingizga ishonchingiz komilmi

# text_waiting_time
source: Waiting Time
ru: Время ожидания
uz: Kutish vaqti

# text_mins
source: mins
ru: минуты
uz: Minut

# text_waiting_time_1
source: Free Waiting Time
ru: Бесплатное время ожидания
uz: Bepul kutish vaqti

# text_waiting_time_2
source: Free Waiting Time Before Trip Start
ru: Бесплатное время ожидания Перед началом поездки
uz: Safar boshlanishidan oldin bepul kutish vaqti

# text_waiting_time_3
source: Free Waiting Time After Trip Start
ru: Бесплатное время ожидания после начала поездки
uz: Safar boshlanganidan keyin bepul kutish vaqti

# text_waiting_price
source: Waiting Price
ru: Цена ожидания
uz: Kutish narxi

# text_discount
source: Discount
ru: Скидка
uz: Chegirma

# text_no_service
source: Service not available in your location
ru: Услуга недоступна в вашем регионе
uz: Xizmat sizning joylashuvingizda mavjud emas

# text_tax_inclusive
source: Inclusive of TAX
ru: Включая НАЛОГ
uz: Soliq bilan

# text_surge_fee
source: Surge fee
ru: Дополнительный сбор
uz: Narxi

# text_choose_payment
source: Choose Payment Method
ru: Выберите способ оплаты
uz: To'lov usulini tanlang

# text_rental_ride
source: Rental Ride
ru: Поездка в аренду
uz: Ijara

# text_regular
source: Regular
ru: Обычный
uz: Muntazam

# text_ride_type
source: Package Name
ru: Название пакета
uz: Paket nomi

# text_referral_code
source: please enter valid referral code
ru: пожалуйста, введите действительный реферальный код
uz: Iltimos, referral kodni kiriting

# text_arrive_eta
source: Driver arrives in
ru: Водитель прибывает в
uz: Haydovchi keldi

# text_email_validation
source: Please enter valid email address
ru: Пожалуйста, введите действительный адрес электронной почты
uz: Iltimos, to'g'ri elektron pochta manzilini kiriting

# text_delete_account
source: Delete Account
ru: Удалить учетную запись
uz: Hisobni o'chirish

# text_delete_confirm
source: Are you sure want to delete your account
ru: Вы уверены, что хотите удалить свою учетную запись
uz: Siz hisobingizni o'chirishni xohlaysizmi

# text_add_cancel_reason
source: Add Cancel Reason
ru: Добавить причину отмены
uz: Bekor qilish sababini qo'shish

# text_chatwithuser
source: Chat with Passenger
ru: Чат с пассажиром
uz: Yo'lovchi bilan suhbat

# text_available
source: Available
ru: Доступно
uz: Mavjud

# text_onboard
source: OnBoard
ru: На борту
uz: Mashina ichida

# text_offline
source: Offline
ru: Автономно
uz: Oflayn

# text_no_data_found
source: No Data Found
ru: Данные не найдены
uz: Ma'lumot topilmadi

# text_manage_vehicle
source: Manage Vehicles
ru: Управление транспортными средствами
uz: Transport vositalarini boshqarish

# text_manage_drivers
source: Manage Drivers
ru: Управление драйверами
uz: Haydovchilarni boshqarish

# text_driver_added
source: Driver Added Successfully
ru: Драйвер успешно добавлен
uz: Haydovchi muvaffaqiyatli qo'shildi

# text_no_driver
source: No Driver
ru: Нет драйвера
uz: Haydovchi yo'q

# text_assign_new_driver
source: Assign new Driver +
ru: Назначить новый драйвер +
uz: Yangi haydovchilarni tayinlang

# text_select_driver
source: Please Select Driver
ru: Пожалуйста, выберите драйвер
uz: Iltimos,haydovchini tanlang

# text_fleet_not_assigned
source: Fleet Not Assigned
ru: Автопарк не назначен
uz: Flit tayinlanmagan

# text_no_driver_found
source: No Drivers Found
ru: Драйверы не найдены
uz: Haydovchilar topilmadi

# text_select_date
source: Select Date
ru: Выберите дату
uz: Sanani tanlang

# text_user
source: User
ru: Пользователь
uz: Foydalanuvchi

# text_driver
source: Driver
ru: Водитель
uz: Haydovchi

# text_driver_not_assigned
source: Driver Not Assigned
ru: Водитель Не назначен
uz: Haydovchi tayinlanmagan

# text_waiting_approval
source: Waiting For Approval
ru: Ожидает Утверждения
uz: Tasdiqlashni kutish

# text_no_vehicle_found
source: No Vehicle Found
ru: Транспортное Средство не найдено
uz: Avtomobil topilmadi

# text_assign_driver
source: Assign Driver
ru: Назначить водителя
uz: Haydovchini tayinlash

# text_upload_doc
source: Upload Docs
ru: Загрузить документы
uz: Hujjatlarni yuklash

# text_vehicle_added
source: Vehicle Succefully Added
ru: Транспортное средство успешно добавлено
uz: Avtomobil muvaffaqiyatli qo'shildi

# text_add_photo
source: Add Photo
ru: Добавить фотографию
uz: Rasm qo'shish

# text_login_driver
source: Login as a Driver
ru: Войти как водитель
uz: Haydovchi sifatida kirish

# text_login_owner
source: Login as a Owner
ru: Войти как владелец
uz: Egasi sifatida kirish

# text_fleet_details
source: Fleet Details
ru: Автопарк Подробности
uz: Fleet tafsilotlari

# text_delete_driver
source: Delete Driver
ru: Удалить драйвер
uz: Haydovchini o'chirish

# text_delete_confirmation
source: Are you sure want to delete this driver ?
ru: Вы уверены, что хотите удалить этот водителя?
uz: Siz ushbu haydovchilarni o'chirishni xohlaysizmi ?

# text_yes
source: Yes
ru: Да
uz: Ha

# text_no
source: No
ru: Нет
uz: Yo'q

# text_fleet_diver_low_bal
source: Your owner wallet balance is low, please contact your owner
ru: Баланс вашего кошелька владельца низкий, пожалуйста, свяжитесь с вашим владельцем
uz: Sizning egasingizning hamyon balansi past, iltimos rahbarizga murojaat qiling

# text_add_vehicle
source: Add Vehicle
ru: Добавить транспортное средство
uz: Avtomobil qo'shish

# text_address
source: Address
ru: Адрес
uz: Manzil

# text_add_driver
source: Add Driver
ru: Добавить водителя
uz: Haydovchi qo'shish

# text_choose_area
source: Choose Area
ru: Выбрать область
uz: Hududni tanlang

# text_company_name
source: Company Name
ru: Название компании
uz: Kompaniya nomi

# text_city
source: City
ru: Город
uz: Shahar

# text_postal_code
source: Postal Code
ru: Почтовый индекс
uz: Pochta indeksi

# text_tax_number
source: Tax Number
ru: Налоговый номер
uz: Soliq raqami

# text_no_fleet_assigned
source: No Fleet Assigned
ru: Автопарк не назначен
uz: Flit tayinlanmagan

# text_ridewithout_destination
source: Ride without Destination
ru: Поездка без пункта назначения
uz: borish nuqtasini ko'rsatmasdan yurish

# text_notification
source: Notification
ru: Уведомление
uz: Xabarnoma

# text_delete_notification
source: Are you sure want to Delete the Notication
ru: Вы уверены, что хотите удалить уведомление
uz: Siz xabarni o'chirishni xohlaysizmi

# text_share
source: Share
ru: Поделиться
uz: Ulashish

# text_share_money
source: Share Money
ru: Поделиться деньгами
uz: Pul junatish

# text_close
source: Close
ru: Закрыть
uz: Yopish

# text_fill_fileds
source: Fill The Fields
ru: Заполнить поля
uz: maydonlarni to'ldiring

# text_admin_commision
source: Admin Commission
ru: Комиссия администратора
uz: Admin komissiyasi

# text_notification_deleted
source: Notification Deleted
ru: Уведомление удалено
uz: Xabarnoma o'chirildi

# text_transferred_successfully
source: Transferred Successfully
ru: Успешно передано
uz: Muvaffaqiyatli o'tkazildi

# text_testing
source: Testing
uz: Sinov

source: Money Deposited
uz: Depozit Qilingan Pul

source: Admin Commission For Trip
uz: Sayohat Uchun Admin Komissiyasi

source: Trip Commission
uz: Sayohat Komissiyasi

# cancellation_fee_title
source: Cancellation Fee
uz: Bekor Qilish To'lovi

source: Money Deposited By Admin
uz: Admin Tomonidan Qo'yilgan Pul

source: Referral Commission
uz: Yo'naltiruvchi Komissiya

source: Spent For Trip Request
uz: Sayohat So'rovi Uchun Sarflangan

source: Withdrawn From Wallet
uz: Hamyondan yechib olish

# text_approval_waiting
source: Verification Pending
ru: Ожидание верификации
uz: Tekshirish kutilmoqda

# text_enter_vehicle_color
source: Enter Your Vehicle Color
ru: Введите цвет вашего автомобиля
uz: Avtomobilingiz Rangini Kiriting

# text_enable_referal
source: Referal
ru: Реферал

# text_faq
source: FAQ
ru: Часто задаваемые вопросы
